{
  "title"           :  "Excerpts from \"Sladerfluous: ‘Fake the Bitters’ by 8bit bEtty\"",
  "date"            :  "2013-10-04",
  "origin"          :  "http://www.8bitx.com/chiptuneswin/sladerfluous-fake-the-bitters-by-8bit-betty/",
  "author"          :  "R. Morgan Slade",
  "albumCoverUrl"   :  "http://f0.bcbits.com/img/a1733206560_10.jpg",
  "body"            : [
                         "You gals and guys are in for a treat this week…",
                         "Track one is ‘Everything Changes (Prelude)’ and trust me when I say that it will change EVERYTHING. Your mood, your day, your hairstyle, EVERYTHING.",
                         "8bit bEtty’s ‘Fake the Bitters’ is the kind of musical creation you won’t realize was missing from your life until you’ve heard it. The first thing you’ll notice about ‘Fake the Bitters’ are the adorable GLaDOS-style voices that take the vocaloid concept to the next level with beautifully intricate manipulation of pitch and harmony to offer a refreshingly vulnerable performance that straddles the line between uplifting and melancholy. I describe the vocals as such with full respect and admiration. This is not simply a gimmick employed but a technique utilized with incredible proficiency. There is clear purpose behind every note, every lyric employed by 8bit bEtty from start to finish culminating in a professional, intense musical offering that may very well act as a milestone in chip music production. I’ll go on record as saying that ‘Fake the Bitters’ may even go so far as to directly influence the genre going forward, creating a “before Fake the Bitters” and an “after Fake the Bitters” timestamp in chip history.",
                         "‘Fake the Bitters’ is unapologetic in its choice of classic chip loops, using them to create a veritable anthem that has the legitimate potential to appeal to the music-loving masses the way Owl City or Imogen Heap have clawed their way through the barrier between niche and mainstream. The secret ingredient that sets ‘Fake the Bitters’ apart from the smorgasbord of typical chiptune offerings is a clear execution of emotional intention. Chip-creators of all skill levels can take 8bit bEtty’s example to heart; if you want to make music that rises above the flood of average chiptune fare, come to your project with a clear feeling/emotion about something that matters to you and then use the sounds you’ve chosen to share those feelings. ‘Fake the Bitters’ is an emotional, heartstring-tugging album that just happens to be chiptune. That is where the true strength of the album lies.",
                         "‘Fake the Bitters’ ends its 8-track album with ‘Everything Changes (reprise)’, an odyssey that revisits themes from throughout the album with such thoughtfulness, attention to detail and skillful transition that I didn’t even notice until I hit replay that I had just listened to a fifteen minute track. It’s like listening to a solo from a musical like Les Misérables; there’s a full story and character arc presented that singlehandedly elevates the credibility of the chiptune genre.",
                         "It’s learning time! Have you heard of the phrase “The medium is the message?” It’s a famous phrase coined by a man named Marshall McLuhan who said that the characteristics of the medium itself, as well as the content delivered over the medium, affects the society in which it plays a role. Radio is a medium, for example, as is the genre of music itself (in this case, chiptune music.) The medium of chiptune music carries with it an inherent sense of nostalgia. The pull that chiptune music has in connecting us with our collective gamer pasts, coupled with our desire to immerse and share those memories with others suggests that chiptune music as a medium could also carry with it the sense of resurgence and renewal. 8bit bEtty’s choice to explore ideas of change, regret, and connection using the medium of chiptune serves to spotlight our connection to the very concept of change, our hesitance to let go and accept change, and our insistence on looking back on the past with rose-colored glasses.",
                         "I said it once and I’ll say it again. 8bit bEtty’s ‘Fake the Bitters’ is one of the most  emotionally engaging chiptune albums I have ever heard. I highly recommend it."
                      ]
}
